import { AppConfig } from '@shared-config';
import React from 'react';

type AppLogoProps = React.SVGProps<SVGSVGElement> & {
  size?: number;
  circleColor?: string;
  letterColor?: string;
  withLabel?: boolean;
  className?: string;
};
/**
 * Компонент SVG-логотипу додатка Holder.
 *
 * @param {number} [size] - Розмір SVG-іконки у пікселях (за замовчуванням 48).
 * @param {string} [circleColor] - Колір кола-фону (за замовчуванням '#7F22FE').
 * @param {string} [letterColor] - Колір літери/символу (за замовчуванням '#FFFFFF').
 * @param {boolean} [withLabel] - Опціональний текст підпису поруч із логотипом.
 * @param {string} [className] - Додаткові CSS класи для зовнішнього контейнера.
 * @param {React.SVGProps<SVGSVGElement>} [props] - Додаткові SVG-пропси.
 */
export const AppLogo = ({
  size = 48,
  circleColor = '#7F22FE',
  letterColor = '#FFFFFF',
  withLabel = false,
  className,
  ...props
}: AppLogoProps) => {
  return (
    <div className={`flex items-center gap-2 ${className}`}>
      <svg
        width={size}
        height={size}
        viewBox="0 0 100 100"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        {...props}
      >
        {/* Фон */}
        <circle cx="50" cy="50" r="50" fill={circleColor} />
        {/* Буква H */}
        <path
          d="M72.6423 69.586C72.6969 70.57 72.8609 71.6086 73.1343 72.702C73.4623 73.7406 74.2276 74.506 75.4303 74.998C74.7196 75.9273 73.4623 76.966 71.6583 78.114C69.8543 79.2073 67.9136 79.918 65.8363 80.246C63.9229 80.5193 62.3103 80.3006 60.9983 79.59C59.7409 78.8246 58.7843 77.7313 58.1283 76.31C57.5269 74.8886 57.1989 73.358 57.1443 71.718C57.1443 71.2806 57.1716 70.3786 57.2263 69.012C57.2809 67.5906 57.3083 65.978 57.3083 64.174C57.3083 62.37 57.2809 60.648 57.2263 59.008C57.2263 57.368 57.1443 56.0833 56.9803 55.154C56.6523 53.35 55.9963 52.3386 55.0123 52.12C54.0829 51.8466 53.0169 52.0653 51.8143 52.776C49.9009 53.8693 48.3156 55.81 47.0583 58.598C45.8556 61.3313 45.2269 64.83 45.1723 69.094C45.1176 70.7886 45.3363 72.0186 45.8283 72.784C46.3203 73.4946 46.5663 73.85 46.5663 73.85C46.5663 73.85 46.2929 74.3146 45.7463 75.244C45.1996 76.1733 44.2156 77.1846 42.7943 78.278C41.3729 79.3166 39.2956 80.0546 36.5623 80.492C35.0316 80.7106 33.7743 80.4373 32.7903 79.672C31.8063 78.852 31.0956 77.704 30.6583 76.228C30.2209 74.752 29.9749 73.194 29.9203 71.554L29.6743 23.912C29.6196 21.6706 29.3736 19.7026 28.9363 18.008C28.4989 16.2586 28.2803 15.384 28.2803 15.384C29.6469 15.22 31.2323 15.1653 33.0363 15.22C34.8949 15.2746 36.6989 15.548 38.4483 16.04C40.2523 16.4773 41.7829 17.2426 43.0403 18.336C44.2976 19.4293 45.0356 20.9053 45.2543 22.764C45.3089 23.1466 45.3636 23.8846 45.4183 24.978C45.5276 26.0166 45.5823 27.0826 45.5823 28.176C45.5276 29.7066 45.7463 30.9913 46.2383 32.03C46.7303 33.0686 47.3863 33.8613 48.2063 34.408C49.1356 34.9546 50.3109 35.146 51.7323 34.982C53.1536 34.7633 54.4109 34.4626 55.5043 34.08C56.5976 33.6426 57.4996 33.3146 58.2103 33.096C58.9756 32.8773 59.7683 32.7133 60.5883 32.604C61.5176 32.4946 62.6109 32.5493 63.8683 32.768C65.1256 32.932 66.3556 33.342 67.5583 33.998C68.8156 34.654 69.8816 35.5833 70.7563 36.786C71.6856 37.9886 72.2596 39.5193 72.4783 41.378C72.8609 44.5486 72.9429 48.43 72.7243 53.022C72.5603 57.5593 72.5329 63.0806 72.6423 69.586Z"
          fill={letterColor}
        />
      </svg>

      {/* Опціональний текст */}
      {withLabel && (
        <span className="text-lg font-extrabold select-none">
          {AppConfig.appName}
        </span>
      )}
    </div>
  );
};
